
class MenuTitle:
    """
    Заголовки пунктов меню.

    Используются в MenuNode для отображения в кнопках и хлебных крошках.
    """
    
    # Главное меню
    MAIN = "🏠 ГЛАВНАЯ"
    
    # Первый уровень
    RECORDS = "📒 МЕНЮ ЗАПИСЕЙ"
    INFO = "ℹ️ МЕНЮ ИНФОРМАЦИИ"
    BULK_ORDER = "📦 МЕНЮ ОПТОВЫХ ЗАКАЗОВ"
    NOTICE = "📝 МЕНЮ ОБЪЯВЛЕНИЙ"
    SERVICE = "⚙️ МЕНЮ СЕРВИСА"
    TRNS = "📑 НОВАЯ ТРАНЗАКЦИЯ"
    
    # Второй уровень: Информация
    AVAILABLE = "💿 МЕНЮ НАЛИЧИЯ"
    
    
    # Второй уровень: Сервис
    GAMES_LIST = "📄 МЕНЮ СПИСКА ИГР"
    
    